buzzwang1/pcb/source/Driver/STM32/L4/HAL/cUart/MpHd/v01.00.03_Mini/cUsart_MpHd.h
#ifndef __cUSART_MPHD_H__
#define __cUSART_MPHD_H__

#include "Typedef.h"
#include "stm32l4xx.h"
#include "stm32l4xx_hal.h"
#include "stm32l4xx_ll_usart.h"
#include "stm32l4xx_ll_lpuart.h"
#include "stm32l4xx_ll_dma.h"

#include "cUartMpHdTimer.h"

#include "tGPPin.h"
#include "ComDat.h"

#include "ClockInfo.h"


class cComNodeListUsartMpHd_Master :public cComNodeList
{
  public:
    cComNodeListUsartMpHd_Master(uint32 lui32SlavesCnt)
      :cComNodeList(lui32SlavesCnt)
    {}

  inline uint32 SizeOf()
  {
    return cComNodeList::SizeOf() +
           sizeof(cComNodeListUsartMpHd_Master);
  }
};


class cUartMpHd
{
  public:
  cComNode::tenState   mSm;
  tenComDeviceStatus   munDeviceStatus;
  tenComBusStatus      munBusStatus;
  tenComStatus         munComStatus;

  u16                  mu16TickCounter;
  u16                  mu16DmaCounter2ms_Old;

  u32                  mu32Baudrate;

  //Single Wire, only Tx Pin
  cGpPin                mPinTx;
  USART_TypeDef*        mUsart;
  DMA_TypeDef*          mDma;
  DMA_Channel_TypeDef*  mChnTx;
  DMA_Channel_TypeDef*  mChnRx;
  u32                   mChnTxFlagTc;
  u32                   mChnRxFlagTc;


  uint8 mui8Adr;
  bool  mbMaster;
  cComNode::tenConsts menOption;

  cUartMpHd(USART_TypeDef *lstUsart, u32 lu32Baudrate, bool  lbMaster)
  {
    mUsart = lstUsart;

    mu32Baudrate = lu32Baudrate;

    munDeviceStatus = tenComDeviceStatus::enDeviceNotInit;
    munBusStatus    = tenComBusStatus::enBusNoError;
    munComStatus    = tenComStatus::enStatusIdle;

    mbMaster        = lbMaster;
    menOption       = cComNode::tenConsts::enNop;


    if (mUsart == USART1)
    {
      mDma = DMA2;
      mChnTx = DMA2_Channel6;
      mChnRx = DMA2_Channel7;
      mChnTxFlagTc = DMA_FLAG_TC6;
      mChnRxFlagTc = DMA_FLAG_TC7;
    }
    else
    if (mUsart == USART2)
    {
      mDma = DMA1;
      mChnTx = DMA1_Channel7;
      mChnRx = DMA1_Channel6;
      mChnTxFlagTc = DMA_FLAG_TC7;
      mChnRxFlagTc = DMA_FLAG_TC6;
    }
    else
    if (mUsart == USART3)
    {
      mDma = DMA1;
      mChnTx = DMA1_Channel2;
      mChnRx = DMA1_Channel3;
      mChnTxFlagTc = DMA_FLAG_TC2;
      mChnRxFlagTc = DMA_FLAG_TC3;
    }
  }

  void  vStopDMA()
  {
    LL_USART_DisableDMAReq_RX(mUsart);
    LL_USART_DisableDMAReq_TX(mUsart);
    mChnTx->CCR &=  ~DMA_CCR_EN; // USART1_TX
    mChnRx->CCR &=  ~DMA_CCR_EN; // USART1_RX
  }

  // Überpruft ob sich der DMA counter geändert hat. Um rauszufinden, ob irgendwas empfangen wurde
  u16 u16GetDmaCounter()
  {
    return mChnRx->CNDTR;
  }

  void  vStartDMARx(uint8* pBuffer, uint32 BufferSize)
  {
    mu16DmaCounter2ms_Old = BufferSize;
    mDma->IFCR = mChnRxFlagTc;
    mChnRx->CNDTR = BufferSize;
    mChnRx->CMAR = (uint32)pBuffer;
    mChnRx->CCR |= (DMA_CCR_EN | DMA_CCR_TCIE);
    LL_USART_EnableDMAReq_RX(mUsart);
  }

  void  vStartDMATx(uint8* pBuffer, uint32 BufferSize)
  {
    mDma->IFCR = mChnTxFlagTc;
    mChnTx->CNDTR = BufferSize;
    mChnTx->CMAR  = (uint32)pBuffer;
    // Ende der Übertragung wird durch  Usart.TC interrupt erledigt
    // Tx DMA Interrupt wird nicht benötigt
    mChnTx->CCR  |=  (DMA_CCR_EN /*| DMA_CCR_TCIE*/);
    LL_USART_EnableDMAReq_TX(mUsart);
  }

  void  vInitHw()
  {
    // Setup Pins
    if (mUsart == USART1) mPinTx.vInit(GPIOA_BASE, 9, GPIO_MODE_OUTPUT_OD, GPIO_PULLUP, GPIO_SPEED_FREQ_LOW, 1);
    else if (mUsart == USART2) mPinTx.vInit(GPIOA_BASE, 2, GPIO_MODE_OUTPUT_OD, GPIO_PULLUP, GPIO_SPEED_FREQ_LOW, 1);
    else if (mUsart == USART3) mPinTx.vInit(GPIOB_BASE,10, GPIO_MODE_OUTPUT_OD, GPIO_PULLUP, GPIO_SPEED_FREQ_LOW, 1);


    /* Restart USART clock */
    if (mUsart == USART1)      { __HAL_RCC_USART1_FORCE_RESET(); __HAL_RCC_USART1_RELEASE_RESET(); __HAL_RCC_USART1_CONFIG(RCC_USART1CLKSOURCE_SYSCLK); }
    else if (mUsart == USART2) { __HAL_RCC_USART2_FORCE_RESET(); __HAL_RCC_USART2_RELEASE_RESET(); __HAL_RCC_USART2_CONFIG(RCC_USART2CLKSOURCE_SYSCLK); }
    else if (mUsart == USART3) { __HAL_RCC_USART3_FORCE_RESET(); __HAL_RCC_USART3_RELEASE_RESET(); __HAL_RCC_USART3_CONFIG(RCC_USART3CLKSOURCE_SYSCLK); }

    // Enable DMA
    if (mUsart == USART1) __HAL_RCC_DMA2_CLK_ENABLE();
    else if (mUsart == USART2) __HAL_RCC_DMA1_CLK_ENABLE();
    else if (mUsart == USART3) __HAL_RCC_DMA1_CLK_ENABLE();

    vStopDMA();

    //SDA and SCL must be pulled high
    if (mbMaster)
    {
      if (!bCheckPins()) return;
    }

    //Single wire, only TX line
    if (mUsart == USART1) { mPinTx.vSetAF(GPIO_MODE_AF_OD, GPIO_AF7_USART1);}
    else if (mUsart == USART2) { mPinTx.vSetAF(GPIO_MODE_AF_OD, GPIO_AF7_USART2);}
    else if (mUsart == USART3) { mPinTx.vSetAF(GPIO_MODE_AF_OD, GPIO_AF7_USART3);}

    // Usart Periph clock enable
    if (mUsart == USART1) __HAL_RCC_USART1_CLK_ENABLE();
    else if (mUsart == USART2) __HAL_RCC_USART2_CLK_ENABLE();
    else if (mUsart == USART3) __HAL_RCC_USART3_CLK_ENABLE();

    // Usart Peripheral Disable
    LL_USART_Disable(mUsart);

    LL_USART_InitTypeDef lstInit;
    LL_USART_StructInit(&lstInit);

    lstInit.BaudRate            = mu32Baudrate;
    lstInit.DataWidth           = LL_USART_DATAWIDTH_9B;
    lstInit.StopBits            = LL_USART_STOPBITS_1;
    lstInit.Parity              = LL_USART_PARITY_NONE;
    lstInit.TransferDirection   = LL_USART_DIRECTION_TX_RX;
    lstInit.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
    lstInit.OverSampling        = LL_USART_OVERSAMPLING_8;

    LL_USART_Init(mUsart, &lstInit);

    LL_USART_EnableHalfDuplex(mUsart);
    LL_USART_ConfigNodeAddress(mUsart, LL_USART_ADDRESS_DETECT_4B, mui8Adr);

    if (!mbMaster)
    {
      LL_USART_EnableMuteMode(mUsart);
      LL_USART_SetWakeUpMethod(mUsart, LL_USART_WAKEUP_ADDRESSMARK);
    }

    // Usart Peripheral Enable
    LL_USART_Enable(mUsart);
    mUsart->ICR = 0xFFFFFFFF;

    //if (!mbMaster)
    //{
    //  LL_USART_RequestEnterMuteMode(mUsart);
    //}

    if (isErrorActive())
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
      munBusStatus    = tenComBusStatus::enDeviceInitErrorDevice;
      return;
    }

    if (mUsart->ISR & USART_ISR_BUSY)
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
      munBusStatus    = tenComBusStatus::enBusNotReady;
      return;
    }

