buzzwang1/pcb/source/Driver/STM32/L4/HAL/cUart/MpHd/v01.00.03_Mini/cUsart_MpHd.h
    // USART TC interrupt
    IRQn_Type lnNVIC_IRQChannel;
    if (mUsart == USART1) lnNVIC_IRQChannel = USART1_IRQn;
    else if (mUsart == USART2) lnNVIC_IRQChannel = USART2_IRQn;
    else /*if (mUsart == USART3)*/ lnNVIC_IRQChannel = USART3_IRQn;

    // Set the priority
    HAL_NVIC_SetPriority(lnNVIC_IRQChannel, 6, 8); // Höhere Prio,wegen Asynchron
    // Enable the TIMx global Interrupt
    HAL_NVIC_EnableIRQ(lnNVIC_IRQChannel);

    mUsart->CR1 |= LL_USART_CR1_TCIE;
    mUsart->CR3 |= LL_USART_CR3_EIE;

    // ----------- DMA ---------
    // DMA Rx
    DMA_HandleTypeDef lhDMA = {};

    lhDMA.Instance = mChnRx;

    lhDMA.Init.Request             = DMA_REQUEST_2;
    lhDMA.Init.Direction           = DMA_PERIPH_TO_MEMORY;
    lhDMA.Init.PeriphInc           = DMA_PINC_DISABLE;
    lhDMA.Init.MemInc              = DMA_MINC_ENABLE;
    lhDMA.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD; // DMA_PDATAALIGN_BYTE; 16 bit wegen 9 Bit transfer
    lhDMA.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    lhDMA.Init.Mode                = DMA_NORMAL;
    lhDMA.Init.Priority            = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&lhDMA);

    // Configure DMA Channel data length
    lhDMA.Instance->CNDTR = 0;
    // Configure DMA Channel destination address
    lhDMA.Instance->CPAR = (uint32_t)&(mUsart->RDR);
    // Configure DMA Channel source address
    lhDMA.Instance->CMAR = 0;

    // DMA interrupt
    if (mUsart == USART1) lnNVIC_IRQChannel = DMA2_Channel7_IRQn; //USART1 connect to channel 7 of DMA2
    else if (mUsart == USART2) lnNVIC_IRQChannel = DMA1_Channel6_IRQn;
    else if (mUsart == USART3) lnNVIC_IRQChannel = DMA1_Channel3_IRQn;
    // Set the TIMx priority
    HAL_NVIC_SetPriority(lnNVIC_IRQChannel, 7, 8);  // Höhere Prio,wegen Asynchron
    // Enable the TIMx global Interrupt
    HAL_NVIC_EnableIRQ(lnNVIC_IRQChannel);

    // DMA Tx
    lhDMA.Instance = mChnTx;

    lhDMA.Init.Request             = DMA_REQUEST_2;
    lhDMA.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    lhDMA.Init.PeriphInc           = DMA_PINC_DISABLE;
    lhDMA.Init.MemInc              = DMA_MINC_ENABLE;
    lhDMA.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD; // DMA_PDATAALIGN_BYTE; 16 bit wegen 9 Bit transfer
    lhDMA.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    lhDMA.Init.Mode                = DMA_NORMAL;
    lhDMA.Init.Priority            = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&lhDMA);

    // Configure DMA Channel data length
    lhDMA.Instance->CNDTR = 0;
    // Configure DMA Channel destination address
    lhDMA.Instance->CPAR = (uint32)&(mUsart->TDR);
    // Configure DMA Channel source address
    lhDMA.Instance->CMAR = 0;

    // DMA interrupt -- TX DMA interrupt wird nicht benötigt
    //if (mUsart == USART1) lnNVIC_IRQChannel = DMA2_Channel6_IRQn; //USART1 connect to channel 6 of DMA2
    //else if (mUsart == USART2) lnNVIC_IRQChannel = DMA1_Channel7_IRQn;
    //else if (mUsart == USART3) lnNVIC_IRQChannel = DMA1_Channel2_IRQn;
    //// Set the TIMx priority
    //HAL_NVIC_SetPriority(lnNVIC_IRQChannel, , 8);  // Höhere Prio,wegen Asynchron
    //// Enable the TIMx global Interrupt
    //HAL_NVIC_EnableIRQ(lnNVIC_IRQChannel);

    munDeviceStatus = tenComDeviceStatus::enDeviceReady;
    munBusStatus    = tenComBusStatus::enBusNoError;
    munComStatus    = tenComStatus::enStatusIdle;
    mSm             = cComNode::tenState::enStIdle;
  }

  void  vReInitHw(cComNode::tenConsts lenOption)
  {
    menOption = lenOption;
  }

  void vTick10ms()
  {
    cComNode::tenConsts lenOption;
    lenOption = menOption;
    if (lenOption != cComNode::tenConsts::enNop)
    {
      if (lenOption == cComNode::enResetHwFull)
      {
        vInitHw();
      }
      else  // enResetHwDma
      {
        // Usart Peripheral Disnable

        // Wenn man Uart deaktiviert, wird (aus welchen Grund auch immer) TC dauerhaft im Uart Status gesetzt
        // => Endlos Interrupt Request
        // Vom daher nicht machen
        // 
        //LL_USART_Disable(mUsart);
        vStopDMA();

        if (mbMaster)
        {
          //TX must be pulled high
          if (!bCheckPins()) return;

          mPinTx.vSetMode(GPIO_MODE_AF_OD);
        }

        mUsart->ICR = 0xFFFFFFFF;

        // Usart Peripheral Enable
        // LL_USART_Enable(mUsart);

        munDeviceStatus = tenComDeviceStatus::enDeviceReady;
        munBusStatus    = tenComBusStatus::enBusNoError;
        munComStatus    = tenComStatus::enStatusIdle;
        mSm             = cComNode::tenState::enStIdle;
      }

      if (isErrorActive())
      {
        munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
        munBusStatus    = tenComBusStatus::enDeviceInitErrorDevice;
        return;
      }

      if (mUsart->ISR & USART_ISR_BUSY)
      {
        munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
        munBusStatus    = tenComBusStatus::enBusNotReady;
        return;
      }

      if (munDeviceStatus == tenComDeviceStatus::enDeviceReady)
      {
        menOption = cComNode::tenConsts::enNop;
      }
    }
  }

  bool  bCheckBus()
  {
    if (mUsart->ISR & USART_ISR_BUSY)
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceError;
      munBusStatus    = tenComBusStatus::enBusNotReady;
      mSm = cComNode::enStError;
      return False;
    }
    return True;
  }

  bool  bCheckPins()
  {
    mPinTx.vSetMode(GPIO_MODE_INPUT);
    //mPinSDA->vSetMode(GPIO_MODE_INPUT);

    //Tx must be pulled high
    if (mPinTx.ui8Get() == 0)
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
      munBusStatus    = tenComBusStatus::enDeviceInitErrorPins;
      mSm             = cComNode::enStError;
      return False;
    }
    return True;
  }
  uint8 isErrorActive()
  {
    return 0;
  }
};



class cUartMpHdMaster : public cUartMpHd
{
  public:

  uint16             mu16ReInitTicks;
  uint16             mu16ReInitTicksReload;
  uint16             mu16ComStuckTicks;
  uint16             mu16ComStuckTicksReload;


