buzzwang1/pcb/source/Driver/STM32/L4/HAL/cUart/MpHd/v01.00.03_Mini/cUsart_MpHd.h
  cComNodeListUsartMpHd_Master  mcSlaves;
  cComNode                      *mpcActiveSlave;
  cComDatMsg                    *mpcActiveMsg;

  cComNode::tenState   menComState;
  uint8               *mpui8ComBuf;
  uint32               mui32ComByteCnt;

  u8                   mu8Lock;
  u8                   mu8SelfTimer;
  bool                 isNoErrorHandling;

  cBotNet_DownLinkUsartMpHd_Timer mTimer;

  cUartMpHdMaster(USART_TypeDef *lstUsart, uint32 lui32Slaves, u32 lu32Baudrate)
    : cUartMpHd(lstUsart, lu32Baudrate, True), mcSlaves(lui32Slaves)
  {
    vInit();
  }

  void vInit()
  {
    mSm = cComNode::tenState::enStIdle;
    menComState = cComNode::tenState::enStIdle;

    mpcActiveSlave = NULL;
    mpcActiveMsg = NULL;

    mui8Adr = 0;
    mu8Lock = 0;
    mu8SelfTimer = 0;
    isNoErrorHandling = False;

    mu16ReInitTicksReload = 100;
    mu16ReInitTicks = mu16ReInitTicksReload;
    mu16ComStuckTicksReload = 2000;
    mu16ComStuckTicks = mu16ComStuckTicksReload;

    vInitHw();
  }

  ~cUartMpHdMaster()
  {
  }

  inline uint32 SizeOf()
  {
    return mcSlaves.SizeOf() + sizeof(cUartMpHdMaster);
  }

  inline void SetLock(u8 lu8Val = 1) { mu8Lock = lu8Val; }
  inline void ResetLock() { mu8Lock = 0; }

  void vResetCom()
  {
    // receiver abschalten um mögliche Overrun-Errors zuvermeiden.
    mUsart->CR1 &= ~USART_CR1_RE;
    // flush Rx register
    mUsart->RQR |= USART_RQR_RXFRQ;
    vStopDMA();

    mTimer.vStop();
    mUsart->ICR = 0xFFFF;
    mu8Lock = 0;
    mpcActiveMsg = NULL;
    mpcActiveSlave = NULL;

    mSm = cComNode::tenState::enStIdle;
    menComState = cComNode::tenState::enStIdle;
  }

  void vSupressErrorHandling()
  {
    isNoErrorHandling = True;
  }

  void vError(cComNode::tenError lenError)
  {
    if (mpcActiveMsg != NULL)
    {
      if (mpcActiveMsg->isBusy())
      {
        mpcActiveMsg->vError();
      }
    }

    mSm = cComNode::tenState::enStIdle;

    if (mpcActiveSlave != NULL)
    {
      mpcActiveSlave->vComError(lenError, menComState);
    }

    if (isNoErrorHandling)
    {
      isNoErrorHandling = False;
    }
    else
    {
      vResetCom();
    }
  }

  void vHandleTimeout()
  {
    vError(cComNode::enErTimeout);
    bStartNext();
  }

  void vPrepareRx()
  {
    mu16TickCounter = 0;
    menComState = cComNode::tenState::enStWaitData;
    mSm = cComNode::tenState::enStWait;
    mu8SelfTimer = 1;
    vStartDMARx(mpcActiveMsg->cRxData.mpu8Data, mpcActiveMsg->cRxData.muiLen);
    // Rx einschalten
    mUsart->CR1 |= USART_CR1_RE;
    mTimer.vStart(250);
  }

  void TIM_EV_IRQHandler()
  {
    if (mpcActiveSlave)
    {
      if (mu8SelfTimer)
      {
        mu8SelfTimer = 0;
        u16 lu16DmaCounter = u16GetDmaCounter();
        if (mu16DmaCounter2ms_Old == lu16DmaCounter) // Counter hat sich nicht geändert
        {
          vHandleTimeout();
        }
      }
      else
      {
        mpcActiveSlave->vComStart(cComNode::tenEvent::enEvMisc);
      }
    }
  }

  void ComIrqHandler(cComNode::tenEventType lenEventType, cComNode::tenEvent lenEvent)
  {
    if (lenEventType == cComNode::tenEventType::enEvTyError)
    {
      vError(cComNode::enErOverrun);
    }
    else
    {
      vSm(lenEventType, lenEvent);
    }

    if (mSm == cComNode::tenState::enStIdle)
    {
      bStartNext();
    }
  }

  void vSetReInitTicks(u16 lu16ReInitTicks)
  {
    if (!mu16ReInitTicks)
    {
      mu16ReInitTicks = lu16ReInitTicks;
    }
  }

  void vTick1ms()
  {
    mu16TickCounter++;
    vSm(cComNode::tenEventType::enEvTySw, cComNode::tenEvent::enEvTick);

    if (mSm == cComNode::enStError)
    {
      if (mu16ReInitTicks)
      {
        mu16ReInitTicks--;

        if (!mu16ReInitTicks)
        {
          mpcActiveMsg   = NULL;
          mu8Lock        = 0;
          this->vReInitHw(cComNode::tenConsts::enResetHwFull);
          this->vReInitAllSlave();
          mu16ReInitTicks = mu16ReInitTicksReload;
        }
      }
    }
    else
    {
      mu16ReInitTicks   = 100;
    }

    if (munComStatus != tenComStatus::enStatusStuck)
    {
      if (mu16ComStuckTicks)
      {
        if (mSm != cComNode::tenState::enStIdle)
        {
          mu16ComStuckTicks--;
        }
      }
      else
      {
        mSm = cComNode::enStError;
        munDeviceStatus   = tenComDeviceStatus::enDeviceReady;
        munBusStatus      = tenComBusStatus::enBusNoError;
        munComStatus      = tenComStatus::enStatusStuck;
        mu16ComStuckTicks = mu16ComStuckTicksReload;
        mu16ReInitTicks   = 100;
      }
    }
  }


  void vAddSlave(cComNode *lpcSlave)
  {
    mcSlaves.vAdd(lpcSlave);
  }

  void vRemoveSlave(cComNode *lpcSlave)
  {
    mcSlaves.vRemove(lpcSlave);
  }

  void vReInitAllSlave()
  {
    mcSlaves.vSetErrorAll(cComNode::tenError::enErReInit, cComNode::cComNode::tenState::enStIdle);
  }

  void vSm(cComNode::tenEventType lenEventType, cComNode::tenEvent lenEvent)  // __attribute__((optimize("-O0")))
  {
    cComNode::tenState mSm_Old;

    UNUSED(lenEventType);

    menComState = cComNode::tenState::enStIdle;

    mSm_Old = mSm;
    switch (mSm)
    {
      case cComNode::tenState::enStIdle:
        switch (lenEvent)
        {
          case cComNode::tenEvent::enEvStart:
            //TX
            if (mpcActiveMsg->cTxData.muiLen > 0)
            {
              menComState = cComNode::tenState::enStAdressAndData;

              // Rx ausschalten
              mUsart->CR1 &= ~USART_CR1_RE;
              mUsart->CR1 |= USART_CR1_TE;

              // flush Rx register
              mUsart->RQR |= USART_RQR_RXFRQ;

              // Adresse nur senden wenn != 0xFF
              if (mpcActiveSlave->mAdr != 0xFF)
              {
                mUsart->TDR = mpcActiveSlave->mAdr | 0x100;
              }
              vStartDMATx(mpcActiveMsg->cTxData.mpu8Data, mpcActiveMsg->cTxData.muiLen);
              // Soll nach dem Senden noch was empfangen werden
              if (mpcActiveMsg->cRxData.muiLen > 0)
              {
                mSm = cComNode::tenState::enStTx;
              }
              else
              {
                mSm = cComNode::tenState::enStEnd;
              }
            }
            else
            if (mpcActiveMsg->cRxData.muiLen > 0)
            {
              vPrepareRx();
            }
            else
            {
              mSm = cComNode::tenState::enStIdle;
              mpcActiveMsg->vDone();
              mpcActiveSlave->vComDone();
            }
            break;
          default:
            break;
        }
        break;
      case cComNode::tenState::enStTx:
        {
          if (lenEvent == cComNode::tenEvent::enEvUsartTc)
          {
            vPrepareRx();
          }
        }
        break;
      case cComNode::tenState::enStWait:
        {
          switch (lenEvent)
          {
            case cComNode::tenEvent::enEvTick:
              {
                if (mu16TickCounter >= 3) // Überprüfen, ob in den letzten 2ms etwas empfangen wurde
                {
                  u16 lu16DmaCounter = u16GetDmaCounter();

                  if (mu16DmaCounter2ms_Old == lu16DmaCounter) // Counter hat sich nicht geändert
                  {
                    vHandleTimeout();
                  }
                  else
                  {
                    mu16TickCounter = 0;
                    mu16DmaCounter2ms_Old = lu16DmaCounter;
                  }
                }
              }
            break;
            case cComNode::tenEvent::enEvDmaRxTc:
              {
                // Rx ausschalten
                mUsart->CR1 &= ~USART_CR1_RE;
                mSm = cComNode::tenState::enStIdle;
                menComState = cComNode::tenState::enStIdle;
                mu8SelfTimer = 0;
                mTimer.vStop();
                vStopDMA();
                mpcActiveMsg->vDone();
                mpcActiveSlave->vComDone();
              }
            break;
            default:
            break;
          }
        }
        break;
      case cComNode::tenState::enStEnd:
        {
          if (lenEvent == cComNode::tenEvent::enEvUsartTc)
          {
            // receiver abschalten um mögliche Overrun-Errors zuvermeiden.
            mUsart->CR1 &= ~USART_CR1_RE;
            mSm = cComNode::tenState::enStIdle;
            menComState = cComNode::tenState::enStIdle;
            vStopDMA();
            mpcActiveMsg->vDone();
            mpcActiveSlave->vComDone();
          }
        }
        break;
      default:
        break;
    }

