buzzwang1/pcb/source/Driver/STM32/L4/HAL/cUart/MpHd/v01.00.03_Mini/cUsart_MpHd.h
    switch (mSm)
    {
      case cComNode::tenState::enStIdle:
      {
        asm("nop");
      }
      break;

      case cComNode::tenState::enStWaitAdress:
        // HW is Muted
        // Wait for adress match and resulting wake up
        // and DMA is finished
        // Before that, PrepareRx has to be called
        if (lui32ISR & USART_ISR_CMF)
        {
          mUsart->ICR = USART_ICR_CMCF;
        }

        switch (lenEvent)
        {
          case cComNode::tenEvent::enEvDmaRxTc:
            {
              vDone();
            }
          break;
          default:
          break;
        }
        break;

      case cComNode::tenState::enStWait:
        {
          switch (lenEvent)
          {
            case cComNode::tenEvent::enEvDmaRxTc:
              {
                // Soll nach dem Empfangen noch was gesendet werden
                if (mpcMsg->cTxData.muiLen > 0)
                {
                  menComState = cComNode::tenState::enStData;
                  LL_USART_SetTransferDirection(mUsart, LL_USART_DIRECTION_TX); // Rx ausschalten
                  vStartDMATx(mpcMsg->cTxData.mpu8Data, mpcMsg->cTxData.muiLen);
                  mSm = cComNode::tenState::enStEnd;
                }
                else
                {
                  vDone();
                }
              }
            break;
            default:
            break;
          }
        }
        break;
      case cComNode::tenState::enStEnd:
        {
          if (lenEvent == cComNode::tenEvent::enEvUsartTc)
          {
            vDone();
          }
        }
        break;
      default:
        break;
    }
  }
};


#endif // __cUSART_MPHD_H__
